import Link from 'next/link'
import React from 'react'

export default function Customer() {
    return (
        <section className="w-full h-fit flex flex-col gap-y-4 px-2 pb-8 pt-28 lg:px-8 lg:max-w-6xl mx-auto relative overflow-hidden">
            <h1 className='text-slate-500 font-semibold text-xl text-center'>
                Угода користувача
            </h1>
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    ДОГОВІР ПУБЛІЧНОЇ ОФЕРТИ
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    Наведений нижче текст є договором між інтернет-магазином, сайт якого розміщений в мережі Інтернет за адресою https://bw73.com.ua/, що має назву надалі «Інтернет-магазин», і користувачем послуг Інтернет-магазину, що має назву надалі «Покупець», і визначає умови купівлі-продажу товарів Покупцем через сайт інтернет-магазину.
                </p>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>1. Загальні положення</h4>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1. Цей договір є договором публічної оферти (відповідно до ст. Ст. 633, 641 і гл. 63 Цивільного кодексу України), його умови однакові для всіх покупців незалежно від статусу (фізична особа, юридична особа, фізична особа - підприємець).
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.2. У разі прийняття умов цього договору, тобто публічної оферти Інтернет-магазину, користувач стає Покупцем.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    2. Терміни та визначення
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    2.1. Інтернет-магазин – BestWishes73, заснований відповідно до Законодавства України, розміщеним в мережі Інтернет за адресою <Link className='underline' href={"https://bw73.com.ua/"}>https://bw73.com.ua</Link></p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.2.Товар - опублікований на сайті Інтернет-магазину перелік товарів..
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.3. Покупець - фізична особа, яка досягла вісімнадцятирічного віку, яка отримує інформацію від Інтернет-магазину, яка розміщує замовлення на пошук, комплектацію та резервування Товарів, які представлені на сайті Інтернет-магазину, для цілей не пов&apos;язаних із здійсненням підприємницької діяльності, чи юридична особа / фізична особа- підприємець.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.4. Замовлення - оформлена і розміщена заявка Покупця, адресована Інтернет-магазину, на пошук, комплектацію та резервування Товарів, для подальшого їх викупу Покупцем.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.5. Сайт - сукупність сторінок, доступ до яких здійснюється за допомогою веб-браузера, і програмних модулів, об&apos;єднаних єдиною системою управління, розташованих в мережі Інтернет за адресою <Link className='underline' href={"https://bw73.com.ua/"}>https://bw73.com.ua</Link>, і містить всі ознаки публічної оферти з пошуку, комплектації і резервування Товарів обраних Покупцем на сайті.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.6. Особистий кабінет - простір на Сайті, доступ до якого має Покупець, в якому відбивається його персональна інформація та історія розміщених ним Замовлень.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    3. Предмет договору
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    3.1. Цей договір визначає порядок взаємодії та умови надання Інтернет-магазином послуг Покупцеві, грунтуючись на його прагненні, бажанні і можливості скористатися послугами пошуку, комплектації і резервування Товарів, а також на прагненні Інтернет-магазину надати Покупцеві потрібну йому інформацію, знайти і укомплектувати Товари згідно Замовлення покупця, і зарезервувати їх для подальшого придбання Покупцем.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.2. Інтернет-магазин надає Покупцеві наступні послуги:
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.2.1. Пошук, комплектація і резервування Товарів на підставі Замовлення, оформленого Покупцем на Сайті і підтвердженого Інтернет-магазином                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.3. Інтернет-магазин здійснює продаж і доставку Товарів за допомогою кур&apos;єрських служб доставки, зазначених на сайті інтернет-магазину на підставі заявок Покупців, залишених на Сайті і підтверджених Інтернет-магазином. Зазначені на Сайті ціни на Товари включають в себе вартість послуг пошуку, комплектації і резервування і доставки товарів Покупців, якщо інше не зазначено в підтвердженні Заявки.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.4. Покупець погоджується з умовами цього договору в момент оформлення Замовлення шляхом натискання на кнопку «Підтвердити замовлення», що виражає підтвердження Покупця про прочитання тексту цього договору і згоду з його умовами. Надалі заперечення від Покупця щодо надання таким чином своєї згоди позбавляє Інтернет-магазин від будь-якого роду відповідальності за невиконання умов цього договору і залишає право Інтернет-магазину скасувати Замовлення в односторонньому порядку.                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    4. Правила роботи з Сайтом
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1. Покупець може переглядати зміст Сайту, оформляти замовлення, а також користуватися іншими його сервісами.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.2. Реєстрація потрібна для доступу Покупця до персоналізованої інформації та надання додаткових можливостей роботи з Сайтом.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.3. При реєстрації Покупець вводить такі дані:
                </p>
                <ul className='text-slate-400 font-semibold text-base list-disc pl-6'>
                    <li>Ім&apos;я, прізвище</li>
                    <li>Номер телефону</li>
                    <li>Адреса електронної пошти</li>
                    <li>Пароль</li>
                </ul>
                <p className='text-slate-400 font-semibold text-base'>
                    4.4. Покупець зобов&apos;язується надати відповідну дійсності, точну і повну інформацію про себе. Інтернет-магазин не несе відповідальності за точність і правильність інформації, залишеної Покупцем при реєстрації та здійсненні Замовлення.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.5. Після реєстрації на Сайті Покупцеві надається доступ до Особистого кабінету.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.6. Покупець зобов&apos;язується не повідомляти третім особам параметри доступу, зазначені при реєстрації. У разі виникнення у Покупця підозр щодо несанкціонованого використання третіми особами таких параметрів, Покупець зобов&apos;язується негайно повідомити про це Інтернет-магазин, надіславши електронний лист на адресу <Link className='underline' href={"mailto:"}>bwishes7373@gmail.com.</Link>
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.7. Покупець несе відповідальність за будь-які дії, здійснені на Сайті під його обліковим записом і від його імені.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.8. Інтернет-магазин має право відмовити Покупцеві в користуванні послугами Інтернет-магазину, якщо у нього будуть підстави вважати, що Покупець вказав недостовірні дані, а так само за умови несумлінної поведінки (наприклад, порушення умов цього договору, або ін.).
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.9. Заборонено використовувати Сайт в протизаконної і забороненої діяльності. Покупці Інтернет-магазину погоджуються дотримуватися законів України і норми поведінки, прийняті в мережі Інтернет, а саме, але не обмежуючись, розміщенням на сайті матеріалів екстремістського, порнографічного чи іншого характеру, що зачіпає і / або ущемляє честь, гідність і / або ділову репутацію третіх осіб і порушують загальноприйняті норми моралі, а також розміщувати рекламну інформацію без дозволу Інтернет-магазину.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    5. Порядок оформлення Замовлення
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    5.1. Покупець оформляє Замовлення на Сайті самостійно, шляхом додавання обраних Товарів в віртуальну корзину і натискаючи кнопку «Оформити замовлення» або натискаючи кнопку «швидке замовлення» та вводячи номер телефонута своє ім’я.               </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    6. Порядок оплати
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    6.1. Покупець набуває Товари, зазначені в розміщеному на Сайті замовленні, а також оплачує послуги Інтернет-магазину на умовах узгоджених сторонами в підтвердженому Інтернет-магазином замовленні Покупця:
                    <br /> - На умовах передоплати на рахунок Інтернет-магазину через систему Liqpay.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.2. Загальна вартість Замовлення, що включає повну вартість Товарів і послуг Інтернет-магазину, дорівнює сумі підлягає оплаті і вказується на Сайті при оформленні і в момент розміщення Замовлення.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    7. Умови повернення.
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    7.1. Повернення і обмін  товарів кінцевим споживачам здійснюється в порядку, передбаченому чинним законодавством України.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    8. Конфіденційність і захист персональних даних
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    8.1. При реєстрації на Сайті Покупець залишає персональні та контактні дані, зазначені в <b> п.4.3.</b> цього договору, але не обмежуються ним.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.2. Надаючи свої персональні дані на Сайті при реєстрації або оформленні Замовлення, Покупець дає свою добровільну згоду на обробку та використання (в тому числі і передачу) своїх персональних даних без обмеження терміну дії такої згоди відповідно до Закону України «Про захист персональних даних» від 01.06 .2010 р
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.3. Інтернет-магазин використовує отримані персональні дані для надання послуг, визначених цим договором, для просування послуг, що надаються Інтернет-магазином, в тому числі і за допомогою автоматизованої обробки персональних даних.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.4. Інтернет-магазин зобов&apos;язується не розголошувати отриману від Покупця інформацію. Не вважається порушенням надання Інтернет-магазином інформації агентам і третім особам, що діють на підставі договору з Інтернет-магазином, в тому числі і для виконання зобов&apos;язань перед Покупцем, а також у випадках, коли розкриття такої інформації встановлено вимогами законодавства.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.5. Якщо Покупець не бажає, щоб Інтернет-магазин продовжував обробляти персональні дані, то Покупцеві необхідно звернутися із заявою в службу підтримки. В цьому випадку Покупець не зможе продовжувати користуватися послугами Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.6. Покупець несе відповідальність за підтримання своїх персональних даних в актуальному стані. Інтернет-магазин не несе відповідальності за неякісне виконання покладених на нього зобов&apos;язань у зв&apos;язку з неактуальністю інформації про Покупця або невідповідністю її дійсності.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    9. Інформаційні повідомлення
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    9.1. Реєструючись на Сайті, Покупець дає Інтернет-магазину згоду на отримання інформаційних повідомлень від Інтернет-магазину і його партнерів, що діють на підставі договору з Інтернет-магазином, за допомогою служби коротких повідомлень (SMS) і електронної пошти.                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    10. Правила використання матеріалів, розміщених на Сайті
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    10.1. Сайт містить матеріали, товарні знаки, фірмові найменування та інші захищені законом матеріали, включаючи, але не обмежуючись, тексти, фотографії, графічні зображення, музичні та звукові твори.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    10.2. Весь зміст Сайту охороняється законодавством України.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    10.3. Покупець не має права використовувати матеріали, розміщені на Сайті, як то: вносити зміни, публікувати, передавати третім особам, брати участь у продажу або уступці, створювати вторинні документи та ін.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h4 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    11. Інші умови
                </h4>
                <p className='text-slate-400 font-semibold text-base'>
                    11.1. Цей договір укладено на території України і
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    11.2. Недійсність будь-якого пункту або частини цього договору не веде до недійсності договору в цілому.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    11.3. Всі суперечки, що виникають між Покупцем та Інтернет-магазином, вирішуються шляхом переговорів. У разі недосягнення врегулювання спірного питання, Покупець або Інтернет-магазин можуть звернутися за вирішенням спору до судових органів відповідно до чинного законодавства.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    11.4. Інтернет-магазин має право вносити зміни в текст цього договору на власний розсуд в будь-який момент і без попереднього повідомлення Покупців. Актуальна (діюча) редакція договору завжди доступна на Сайті
                </p>
            </div>
        </section>
    )
}
