import React from 'react'

export default function AboutUs() {
    return (
        <section className="w-full h-fit flex flex-col items-center justify-center gap-y-4 px-2 pb-8 pt-28 lg:px-8 lg:max-w-6xl mx-auto relative overflow-hidden">
            <h1 className='text-slate-500 font-semibold text-xl text-center'>
                Про нас
            </h1>
            <p className='text-slate-400 font-semibold text-base'>

                Місія компанії - покращити розуміння правильного і дійсно якісного догляду за здоров'ям та шкірою і допомогти  людям відмовитись від хибних стереотипів у споживанні засобів по догляду за здоров'ям та красою.
                Візія компанії - запропонувати споживачам оптимальну та водночас багатовекторну лінійку косметичної продукції, що створить можливість отримати найкрищай асортимент засобів по догляду за здоров'ям та красою в рамках одного мультибренду.
                <br />Цінності компанії : <br />
                <br /> - турбота : ми працюємо як одна команда на благо людей, впевнені у якості та результаті використання нашої продукції, постійно вивчаємо тенденції та актуальні запити ринку щоб своєчасно реагувати на потреби суспільства.
                <br /> - довіра : ми застосовуємо у виробництві лише перевірені та якісні інгридієнти, продукцію ретельно і відповідально тестуємо, пропонуємо лише ті засоби, які дійсно потрібні і достатні для найефективнішого  догляду.
                <br /> - дружня політика : ми допомагаємо не тільки бути фахівцем у сфері догляду за красою та здоров'ям свого тіла, пропонуючи споживачам якісну продукцію за кращу ціну, а стати нашим партнером, побудувавши свій бізнес усередині нашої компанії на чесних взаємовідносинах та прозорій комунікації як із зовнішнім, так і з внутрішнім середовищем.
            </p>
        </section>
    )
}
