import Link from 'next/link'
import React from 'react'

export default function Policy() {
    return (
        <section className="w-full h-fit flex flex-col gap-y-4 px-2 pb-8 pt-28 lg:px-8 lg:max-w-6xl mx-auto relative overflow-hidden">
            <h1 className='text-slate-500 font-semibold text-xl text-center'>
                Політика конфіденційності
            </h1>
            <p className='text-slate-400 font-semibold text-base'>
                Дана Політика конфіденційності персональних даних (далі – Політика конфіденційності) діє стосовно всієї інформації, яку Інтернет-магазин косметики BestWishes73, розташований на доменному імені <Link href={"https://bw73.com.ua/"} className='underline'>https://bw73.com.ua/</Link>, може отримати про Користувача під час використання сайту Інтернет -магазину, програм та продуктів Інтернет-магазину.
            </p>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    1. ВИЗНАЧЕННЯ ТЕРМІНІВ
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1 У цій Політиці конфіденційності використовуються такі терміни:
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.1. «Адміністрація сайту Інтернет-магазину (далі – Адміністрація сайту)» – уповноважені співробітники на управління сайтом, що діють від імені ramosu.com.ua, які організують та (або) здійснює обробку персональних даних, а також визначає цілі обробки персональних даних, склад персональних даних, що підлягають обробці, дії (операції), які здійснюються з персональними даними.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.2. «Персональні дані» - будь-яка інформація, що відноситься до прямо чи опосередковано визначеної чи визначеної фізичної особи (суб'єкта персональних даних)
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.3. «Обробка персональних даних» - будь-яка дія (операція) або сукупність дій (операцій), що здійснюються з використанням засобів автоматизації або без використання таких засобів з персональними даними, включаючи збирання, записування, систематизацію, накопичення, зберігання, уточнення (оновлення, зміну), вилучення, використання, передачу (поширення, надання, доступ), знеособлення, блокування, видалення, знищення персональних даних.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.4. «Конфіденційність персональних даних» - обов'язкова для дотримання Оператором або іншою особою, яка отримала доступ до персональних даних, вимога не допускати їх розповсюдження без згоди суб'єкта персональних даних або наявності іншої законної підстави.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.5. «Користувач сайту Інтернет-магазину (далі – Користувач)» – особа, яка має доступ до сайту, за допомогою мережі Інтернет та використовує сайт Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.6. {"Cookies"} — невеликий фрагмент даних, надісланий веб-сервером і зберігається на комп'ютері користувача, який веб-клієнт або веб-браузер щоразу пересилає веб-серверу в HTTP-запиті, намагаючись відкрити сторінку відповідного сайту.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    1.1.7. IP-адреса — унікальна мережна адреса вузла в комп'ютерній мережі, побудованій за протоколом IP.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    2. ЗАГАЛЬНІ ПОЛОЖЕННЯ
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    2.1. Використання Користувачем сайту Інтернет-магазину означає згоду з цією Політикою конфіденційності та умовами обробки персональних даних Користувача.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.2. У разі незгоди з умовами Політики конфіденційності, Користувач повинен припинити використання сайту Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.3.Ця Політика конфіденційності застосовується лише до сайту Інтернет-магазину. Інтернет-магазин не контролює та не несе відповідальності за сайти третіх осіб, на які Користувач може перейти за посиланнями, доступними на сайті Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    2.4. Адміністрація сайту не перевіряє достовірність персональних даних, які надає Користувач сайту Інтернет-магазину.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    3. ПРЕДМЕТ ПОЛІТИКИ КОНФІДЕНЦІЙНОСТІ
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    3.1. Ця Політика конфіденційності встановлює {"зобов'язання"} Адміністрації сайту Інтернет-магазину щодо нерозголошення та забезпечення режиму захисту конфіденційності персональних даних, які Користувач надає на запит Адміністрації сайту при реєстрації на сайті Інтернет-магазину або при оформленні замовлення на придбання Товару.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.2. Персональні дані, дозволені для обробки в рамках цієї Політики конфіденційності, надаються Користувачем шляхом заповнення реєстраційної форми на сайті Інтернет-магазину в розділі реєстрації або в розділі замовлення товарів і включають таку інформацію:
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.2.1. Прізвище, ім'я, по-батькові Користувача;<br />
                    3.2.2. Контактний телефон Користувача;<br />
                    3.2.3. Адреса електронної пошти (e-mail);<br />
                    3.2.4. Адреса доставки товару;<br />
                    3.2.5. Місце проживання Користувача.<br />
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.3. Інтернет-магазин захищає Дані, що автоматично передаються в процесі перегляду рекламних блоків та при відвідуванні сторінок, на яких встановлено статистичний скрипт системи:
                    <br />• IP-адреса;
                    <br />• Інформація з cookies;
                    <br />• Інформація про браузер (або іншу програму, яка здійснює доступ до показу Реклами);
                    <br />• Час доступу;
                    <br />• Адреса сторінки, де розташований рекламний блок;
                    <br />• Реферер (адреса попередньої сторінки).
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.3.1. Відключення cookies може спричинити неможливість доступу до частин сайту Інтернет-магазину, які потребують авторизації.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    3.3.2. Інтернет-магазин здійснює збір статистики про IP-адреси своїх відвідувачів. Дана інформація використовується з метою виявлення та вирішення технічних проблем, для контролю законності фінансових платежів, що проводяться.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    вище (історія покупок, браузери та операційні системи тощо) підлягає надійному зберіганню та нерозповсюдженню, за винятком випадків, передбачених у пп. 5.2. та 5.3. цієї Політики конфіденційності.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    4. ЦІЛІ ЗБОРУ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ КОРИСТУВАЧА
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1. Персональні дані Користувача Адміністрація сайту Інтернет-магазину може використовуватись з метою:
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.1. Ідентифікації Користувача, зареєстрованого на сайті Інтернет-магазину, для оформлення замовлення та (або) укладання Договору купівлі-продажу товару дистанційним способом із Інтернет-магазином <Link className='underline' href={"https://ramosu.com.ua"}>ramosu.com.ua</Link> ;
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.2. Надання Користувачеві доступу до персоналізованих ресурсів сайту Інтернет-магазину;
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.3. встановлення з Користувачем зворотного зв'язку, включаючи направлення повідомлень, запитів щодо використання сайту Інтернет-магазину, надання послуг, обробка запитів та заявок від Користувача;
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.4. Визначення місця знаходження Користувача для забезпечення безпеки, запобігання шахрайству;
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.5. Підтвердження достовірності та повноти персональних даних, наданих Користувачем;
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.6. Створення облікового запису для здійснення покупок, якщо Користувач погодився на створення облікового запису;
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.7. Повідомлення Користувача сайту Інтернет-магазину про стан Замовлення.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.8. Обробка та отримання платежів, підтвердження податку або податкових пільг, оскарження платежу, визначення права на отримання кредитної лінії Користувачем.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.9. Надання Користувачеві ефективної клієнтської та технічної підтримки у разі виникнення проблем, пов'язаних з використанням сайту Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.10. Надання Користувачеві з його згоди, оновлень продукції, спеціальних пропозицій, інформації про ціни, розсилки новин та інших відомостей від імені Інтернет-магазину або від імені партнерів Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.11. Здійснення рекламної діяльності за згодою Користувача.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    4.1.12. Надання доступу Користувачеві на сайти або сервіси партнерів Інтернет-магазину з метою отримання продуктів, оновлень та послуг.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    5. СПОСОБИ ТА ТЕРМІНИ ОБРОБКИ ПЕРСОНАЛЬНОЇ ІНФОРМАЦІЇ
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    5.1. Обробка персональних даних Користувача здійснюється без обмеження строку будь-яким законним способом, у тому числі в інформаційних системах персональних даних з використанням засобів автоматизації або без використання таких засобів.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    5.2. Користувач погоджується з тим, що Адміністрація сайту має право передавати персональні дані третім особам, зокрема кур'єрським службам, організаціям поштового зв'язку, операторам електрозв'язку, виключно з метою виконання замовлення Користувача, оформленого на сайті Інтернет-магазину <Link className='underline' href={"https://ramosu.com.ua"}>ramosu.com.ua</Link> , включаючи доставку
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    5.3. Персональні дані Користувача можуть бути передані уповноваженим органам державної влади України лише на підставах та в порядку, встановлених законодавством України.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    5.4. У разі втрати або розголошення персональних даних Адміністрація сайту зобов'язана проінформувати Користувача про втрату або розголошення персональних даних.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    5.5. Адміністрація сайту вживає необхідних організаційних та технічних заходів для захисту персональної інформації Користувача від неправомірного або випадкового доступу, знищення, зміни, блокування, копіювання, розповсюдження, а також від інших неправомірних дій третіх осіб.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    5.6. Адміністрація сайту спільно з Користувачем вживає всіх необхідних заходів щодо запобігання збиткам або іншим негативним наслідкам, спричиненим втратою або розголошенням персональних даних Користувача.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    {"6. ОБОВ'ЯЗКИ СТОРІН"}
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    6.1. Користувач зобов'язаний
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.1.1. Надати інформацію про персональні дані, необхідну для користування сайтом Інтернет-магазину.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.1.2. Оновити, доповнити надану інформацію про персональні дані у разі зміни даної інформації.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.2. Адміністрація сайту зобов'язана:
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.2.1. Використовувати отриману інформацію виключно для цілей, зазначених у п. 4 цієї Політики конфіденційності.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.2.2. Забезпечити зберігання конфіденційної інформації в таємниці, не розголошувати без попередньої письмової згоди користувача, а також не здійснювати продаж, обмін, публікацію або розголошення іншими можливими способами переданих персональних даних користувача, крім п.п. 5.2. та 5.3. цієї Політики конфіденційності.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.2.3. Вживати запобіжних заходів для захисту конфіденційності персональних даних користувача відповідно до порядку, який зазвичай використовується для захисту такого роду інформації в існуючому діловому обороті.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    6.2.4. Здійснити блокування персональних даних, що належать до відповідного Користувача з моменту звернення або запиту користувача або його законного представника або уповноваженого органу захисту прав суб'єктів персональних даних на період перевірки, у разі виявлення недостовірних персональних даних або неправомірних дій.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    7. ВІДПОВІДАЛЬНІСТЬ СТОРІН
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    7.1. Адміністрація сайту, яка не виконала своїх зобов'язань, несе відповідальність за збитки, завдані Користувачем у зв'язку з неправомірним використанням персональних даних відповідно до законодавства України, за винятком випадків, передбачених п.п. 5.2., 5.3. та 7.2. цієї Політики конфіденційності.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    7.2. У разі втрати або розголошення Конфіденційної інформації Адміністрація сайту не несе відповідальності, якщо дана конфіденційна інформація:
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    7.2.1. Стала публічним надбанням до її втрати чи розголошення.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    7.2.2. Була отримана від третьої сторони до її отримання Адміністрацією сайту.
                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    7.2.3. Була розголошена за згодою користувача.
                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    8. Вирішення суперечок
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    8.1. До звернення до суду із позовом щодо спорів, що виникають із відносин між Користувачем сайту Інтернет-магазину та Адміністрацією сайту, обов'язковим є пред'явлення претензії (письмової пропозиції щодо добровільного врегулювання спору).                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.2 Одержувач претензії протягом 30 календарних днів з дня отримання претензії письмово повідомляє заявника претензії про результати розгляду претензії.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.3. При недосягненні угоди спір буде передано на розгляд до судового органу відповідно до чинного законодавства України.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    8.4. До цієї Політики конфіденційності та відносин між Користувачем та Адміністрацією сайту застосовується чинне законодавство України.                </p>
            </div>
            {/*  */}
            <div className='flex flex-col gap-y-2 items-start justify-start'>
                <h3 className='text-lg font-semibold text-slate-500 lowercase first-letter:uppercase'>
                    9. ДОДАТКОВІ УМОВИ
                </h3>
                <p className='text-slate-400 font-semibold text-base'>
                    9.1. Адміністрація сайту має право вносити зміни до цієї Політики конфіденційності без згоди користувача.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    9.2. Нова Політика конфіденційності та/або зміни в цій Політиці набирають чинності з моменту їх розміщення на сайті Інтернет-магазину, якщо інше не передбачено новою редакцією Політики конфіденційності.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    9.3. Усі пропозиції чи питання щодо цієї Політики конфіденційності слід повідомляти в розділ підтримки.                </p>
                <p className='text-slate-400 font-semibold text-base'>
                    Чинна Політика конфіденційності розміщена на сторінці сайту за адресою  <Link className='underline' href={"https://bw73.com.ua/faq/policy "}>https://bw73.com.ua/faq/policy </Link>               </p>
            </div>
        </section>
    )
}
